Repository: VietThan/po4a-website
Catalog: po/www/*.po
Languages: pl

source: po4a - Welcome
pl: po4a - Witamy

source: Welcome!
pl: Witamy!

source: The po4a (PO for anything) project goal is to ease translations (and more interestingly, the maintenance of translations) using gettext tools on areas where they were not expected like documentation.
pl: Celem projektu po4a ("PO for anything") jest ułatwienie tłumaczeń (oraz, co ciekawsze, zarządzania tłumaczeniami) przy użyciu narzędzi gettext tam, gdzie nie były używane, jak na przykład w tłumaczeniach dokumentacji.

source: 2010-12-01 - po4a 0.41 released
pl: 2010-12-01 - po4a 0.41 wydany

source: This release modifies how titles are handled in AsciiDoc, the trailing newline is removed from PO strings. Other changes are: backups for PO files are no more generated; carriage returns are filtered away from input files.
pl: Wydanie zmienia sposób obsługi tytułów w formacie AsciiDoc - z komunikatów PO usuwany jest końcowy znak nowej linii. Pozostałe zmiany: nie są tworzone kopie zapasowe plików PO, znaki powrotu karetki są usuwane z plików wejściowych.

source: 2010-11-30 - po4a 0.40.2 released
pl: 2010-11-30 - po4a 0.40.2 wydany

source: This is a translation release. Documentation has been reviewed, and many translations updated.
pl: Aktualizacje tłumaczeń. Dokumentacja została przejrzana, a wiele tłumaczeń zostało zaktualizowanych.

source: 2010-08-25 - po4a 0.40.1 released
pl: 2010-08-25 - po4a 0.40.1 wydany

source: This is mostly a translation release. Documentation has been reviewed, and many translations updated. The header entry when creating POT files has also been modified in order to be consistent with xgettext.
pl: Aktualizacje tłumaczeń. Dokumentacja została przejrzana, a wiele tłumaczeń zostało zaktualizowanych. Zmieniono także nagłówek tworzonych plików POT, tak aby był spójny z nagłówkiem plików tworzonych przez xgettext.

source: 2010-07-27 - po4a 0.40 released
pl: 2010-07-27 - po4a 0.40 wydany

source: This is a bugfix release. Most notable fixes are: Text: fix failures "Unknown option: copyright-holder"; Man: support font modifiers in the form \f(XX and \f[FONT-NAME].
pl: Poprawki błędów. Najbardziej zauważalne to: Text: poprawienie błędu "Nieznana opcja: copyright-holder";Man: wsparcie dla modyfikatorów czcionki \f(XX i \f[NAZWA-CZCIONKI].

source: 2010-02-02 - po4a 0.39 released
pl: 2010-02-02 - po4a 0.39 wydany

source: This release provides a new syntax for addenda, files can be preceded by optional modifiers to allow more customization.
pl: Nowa składnia załączników: nazwy plików mogą być poprzedzone przez opcjonalne modyfikatory, pozwalając na lepsze dostosowanie do potrzeb użytkownika.

source: 2010-01-14 - po4a 0.38 released
pl: 2010-01-14 - po4a 0.38 wydany

source: This is a bugfix release. Most notable fixes are: add an option to specify language in translated XML; let po4a exit with non-zero exit code if master file does not exist; fix handling of multi-lines placeholder tags. By default, po4a now calls msgmerge with the <code>--previous</code> option so that previous strings are displayed above fuzzy strings in PO files.
pl: Poprawki błędów. Najbardziej zauważalne z nich to: dodanie opcji określającej język tłumaczonego pliku XML; zwracanie przez po4a niezerowego kodu zakończenia, gdy nie istnieje plik z oryginałem dokumentu do przetłumaczenia; poprawienie obsługi wieloliniowych znaczników . Domyślnie po4a wywołuje msgmerge z opcją <code>--previous</code>, tak żeby komentarze do niepewnych komunikatów w plikach PO zawierały poprzednie wersje oryginalnych komunikatów.

source: 2009-11-20 - po4a 0.37.0 released
pl: 2009-11-20 - po4a 0.37.0 wydany

source: This release provides <a href="man/man1/po4a-build.1.php">po4a-build</a>, which allows building all translations (code, documentation, text files, etc) with a single file <a href="man/man5/po4a-build.conf.5.php">po4a-build.conf</a>.
pl: Dodanie narzędzia <a href="man/man1/po4a-build.1.php.pl">po4a-build</a>, które pozwala na zbudowanie wszystkich tłumaczeń (kodu, dokumentacji, plików źródłowych itp.) przy użyciu jednego pliku konfiguracyjnego <a href="man/man5/po4a-build.conf.5.php.pl">po4a-build.conf</a>.

source: 2009-11-08 - po4a 0.36.6 released
pl: 2009-11-08 - po4a 0.36.6 wydany

source: There has been three minor releases for bug fixes and small new features. The most notable new features are:
pl: Trzy pomniejsze wydania usuwające błędy i dodające niewielkie nowe właściwości, spośród których najbardziej godne uwagi są:

source: <a href="man/man1/po4a.1.php">po4a</a>: new options --srcdir and --destdir.
pl: <a href="man/man1/po4a.1.php.pl">po4a</a>: nowe opcje: --srcdir i --destdir.

source: <a href="man/man1/po4a-updatepo.1.php">po4a-updatepo</a>: new options --msgid-bugs-address, --copyright-holder, --package-name, and --package-version.
pl: <a href="man/man1/po4a-updatepo.1.php.pl">po4a-updatepo</a>: nowe opcje --msgid-bugs-address, --copyright-holder, --package-name oraz --package-version.

source: new and updated <a href="translations.php">translations</a> (Basque, Czech, Esperanto, Estonian, French, German, Portuguese, Russian, Spanish, Swedish, Vietnamese).
pl: nowe i zaktualizowane <a href="translations.php.pl">tłumaczenia</a> (baskijskie, czeskie, esperanckie, estońskie, francuskie, niemieckie, portugalskie, rosyjskie, hiszpańskie, szwedzkie, wietnamskie).

source: <a href="man/man3pm/Locale::Po4a::Sgml.3pm.php">Sgml module</a>: better detection of entities in the prolog.
pl: <a href="man/man3pm/Locale::Po4a::Sgml.3pm.php.pl">Moduł SGML</a>: lepsze wykrywanie encji w prologu.

source: <a href="man/man3pm/Locale::Po4a::Text.3pm.php">Text module</a>: new options breaks and tabs.
pl: <a href="man/man3pm/Locale::Po4a::Text.3pm.php.pl">Moduł Text</a>: nowe opcje przerywania akapitów i tabulacji.

source: 2009-07-22 - po4a 0.36.3 released
pl: 2009-07-22 - po4a 0.36.3 wydany

source: There has been three minor releases for bug fixes. These minor releases also improved the support for Markdown; added the po4apod-display-po script; added the options --msgid-bugs-address, --copyright-holder, --package-name, --package-version to po4a-gettextize; and added the option customtag to the Xml and derivative modules.
pl: Trzy pomniejsze wydania usuwające błędy. Wydania ta ulepszyły wsparcie dla Markdown, dodały skrypt po4apod-display-po, dodały opcje -msgid-bugs-address, --copyright-holder, --package-name, --package-version do po4a-gettextize oraz dodały opcję customtag do modułu Xml i pochodnych.

source: 2009-03-15 - po4a 0.36 released
pl: 2009-03-15 - po4a 0.36 wydany

source: This release provides improvements for the Xml (and derivative), Man, and TeX modules. It also changes how the type of strings is provided in the PO file. This type will now be provided as an "extracted comment" instead of a "translator comment".
pl: To wydanie ulepsza moduły Xml (i pochodne), Man oraz TeX. Zmienia także typ komunikatów dostarczanych w plikach PO - z "komentarz tłumacza" na " komentarz wyekstrahowany".

source: 2009-02-10 - po4a 0.35 released
pl: 2009-02-10 - po4a 0.35 wydany

source: This release introduces features in the po4a tools (new [po_directory] command in po4a's configuration files, new --blank option for po4a-normalize, and improved conflict handling for po4a-gettextize), and support for the AsciiDoc format. The Docbook module has a better support of all v5.0, and earlier tags. Also the Xml and derivative modules run faster and have a more comprehensible set of options, and support placeholders by default to ease the translation and mark the location of sub-blocks.
pl: Wydanie to dodaje nowe funkcjonalności do narzędzi po4a (nowe polecenie [po_directory] w plikach konfiguracyjnych po4a, dodana opcja --blank do po4a-normalize, ulepszone rozwiązywanie konfliktów przez po4a-gettextize) oraz wsparcie dla formatu AsciiDoc. Moduł Docbook lepiej wspiera wszystkie elementy z wersji 5.0 i wcześniejszych. Ponadto moduły Xml i pochodne działają szybciej i mają bardziej przystępny zbiór opcji oraz domyślnie wspierają wypełniacze, aby ułatwić tłumaczenia i oznaczyć lokalizacje podbloków.

source: 2008-04-02 - po4a 0.33.3 released
pl: 2008-04-02 - po4a 0.33.3 wydany

source: 0.33.1, 0.33.2, and 0.33.3 are minor releases with bug fixes in the Xml and Man modules. Some changes were done in the packaging to fix the installation path of translated manpages and MO files. Manpages are now installed in UTF-8 and the encoding of their title was fixed. 0.33.2 also adds a Japanese translation, a new Wml module, and the support for the fortunes format in the Text module.
pl: 0.33.1, 0.33.2 oraz 0.33.3 są niewielkimi wydaniami zawierającymi tylko i wyłącznie poprawki błędów w modułach Xml oraz man. W skryptach instalacyjnych poprawiono ścieżki do przetłumaczonych stron podręcznika oraz plików MO. Strony podręcznika są instalowane w kodowaniu UTF-8, poprawiono również ich tytuły. 0.32.2 dodaje także tłumaczenia na język japoński, nowy moduł Wml oraz wsparcie w module Text dla formatu plików fortunek.

source: 2008-03-03 - po4a 0.33 released
pl: 2008-03-03 - po4a 0.33 wydany

source: Major changes in the handling of PO files (fix the handling of PO files with plural forms, and fix the handling of headers for msguntypot), and in the Texinfo or Xml and derivative modules (e.g. docbook).
pl: Spore zmiany w obsłudze plików PO (poprawienie obsługi plików PO zawierających formy liczby mnogiej, oraz obsługi nagłówków przez msguntypot) i w modułach Texinfo, XML oraz od nich pochodzących (np. docbook).

source: 2007-08-16 - New website
pl: 2007-08-16 - Nowa strona www

source: We've changed the aspect of our web site and we've added some contents to help new users to use po4a.
pl: Zmieniliśmy wygląd naszej strony www i dodaliśmy trochę zawartości, aby pomóc nowym użytkownikom nauczyć się obsługi po4a.

source: 2007-08-15 - po4a 0.32 released
pl: 2007-08-15 - po4a 0.32 wydany

source: Project links
pl: Linki projektowe

source: The <a href="http://alioth.debian.org/projects/po4a/">po4a project</a> is hosted on <a href="http://alioth.debian.org">Alioth</a>.
pl: <a href="http://alioth.debian.org/projects/po4a/">Projekt po4a</a> jest utrzymywany na <a href="http://alioth.debian.org">serwerze Alioth</a>.

source: po4a - Documentation
pl: po4a - Dokumentacja

source: Documentation
pl: Dokumentacja

source: Here is an HTML version of the po4a's manpages.
pl: Poniżej znajduje się wersja HTML stron podręcznika po4a.

source: The <a href="man/man7/po4a.7.php">po4a.7</a> manpage provides an introduction to po4a.
pl: Strona <a href="man/man7/po4a.7.php.pl">po4a.7</a> jest wprowadzeniem do po4a.

source: For more details, the <a href="man/">index</a> provides the documentation of the various commands and modules.
pl: Szczegółową dokumentację różnych poleceń i modułów można znaleźć na stronie z <a href="man/">indeksem</a>.

source: Help
pl: Pomoc

source: We can help you to set up a translation framework for your project's documentation or to adapt po4a to your needs. Do not hesitate to contact us on our <a href="mailto:po4a-devel@lists.alioth.debian.org">mailing list</a> or on IRC (#po4a on oftc).
pl: Możemy Ci pomóc w skonfigurowaniu środowiska do tłumaczeń w Twoim projekcie lub zaadaptowaniu istniejącego środowiska do potrzeb po4a. Nie wahaj się skontaktować z nami za pomocą naszej <a href="mailto:po4a-devel@lists.alioth.debian.org">listy dyskusyjnej</a> lub przez IRC (#po4a na oftc).

source: po4a - Download
pl: po4a - Pobieranie

source: Sources
pl: Źródła

source: You can find the sources of the latest release on <a href="http://alioth.debian.org/frs/?group_id=30267">Alioth</a>.
pl: Źródła najnowszej wersji można pobrać z <a href="http://alioth.debian.org/frs/?group_id=30267">serwera Alioth</a>.

source: Binary
pl: Binaria

source: po4a is a Perl module. It is available as a binary package in many OpenSource distributions (Debian, Ubuntu, FreeBSD, Gentoo, Fedora, Mandriva, and probably others).
pl: po4a jest modułem Perla i jest dołączany jako pakiet binarny do różnych dystrybucji (Debian, Ubuntu, FreeBSD, Gentoo, Fedora, Mandriva i najprawdopodobniej innych).

source: The latest sources are available from our <a href="http://alioth.debian.org/scm/?group_id=30267">Subversion repository</a>.
pl: Najnowsze źródła można pobrać z naszego <a href="http://alioth.debian.org/scm/?group_id=30267">repozytorium Subversion</a>.

source: It also contains additional modules which are being considered, but are not of a sufficient quality.
pl: Repozytorium zawiera także dodatkowe moduły, których dołączenie rozważamy, ale ich jakość nie jest jeszcze wystarczająca.

source: po4a - Features
pl: po4a - właściwości

source: Introduction
pl: Wstęp

source: po4a extracts the translatable material from its input in a PO file.
pl: po4a wyciąga ze swoich wejściowych plików PO materiał, który może być tłumaczony.

source: When the PO file is translated, it re-injects the translation in the structure of the document, and generates the translated document.
pl: Kiedy plik PO zostanie przetłumaczony, po4a dopasuje tłumaczenia do struktury oryginalnego dokumentu i wygeneruje dokument przetłumaczony.

source: If a string is not translated (i.e. it was not translated or it is "fuzzy" because the original document was updated), the original string is used.
pl: Jeżeli komunikat nie jest przetłumaczony (np. w ogóle nie był tłumaczony lub jest oznaczony jako niepewny - "fuzzy" - ponieważ oryginalny dokument został zaktualizowany), używany jest oryginalny komunikat.

source: This permits to provide always up-to-date documentation.
pl: Pozawala to na dostarczanie dokumentacji cały czas aktualnej.

source: Supported formats
pl: Obsługiwane formaty

source: po4a supports currently the following formats:
pl: Obecnie po4a obsługuje następujące formaty:

source: manpages
pl: strony podręcznika ekranowego

source: XML (generic, DocBook, XHTML, Dia, Guide, or WML)
pl: XML (ogólny, DocBook, XHTML, Dia, Guide lub WML)

source: TeX (generic, LaTeX, or Texinfo)
pl: TeX (ogólny, LateX lub Texinfo)

source: text (simple text files with some formatting, markdown, or AsciiDoc)
pl: tekst (proste pliki tekstowe z formatowaniem, znacznikami lub AsciiDoc)

source: KernelHelp
pl: komunikaty pomocy kompilacji jądra

source: Configuration file
pl: Plik konfiguracyjny

source: You can use a configuration file to ease its usage to a single command invocation. This configuration file will contain the list of documents, the options, etc.
pl: Za pomocą pliku konfiguracyjnego,zawierającego listę dokumentów, opcji, itp., można sobie ułatwić używanie po4a, sprowadzając je do pojedynczego wywołania polecenia.

source: When invoked with a configuration file, po4a uses an 'a la make' algorithm to detect if files changed and if an operation is required.
pl: po4a, uruchomiony z plikiem konfiguracyjnym, używa algorytmu podobnego do tego z programu "make", aby wykryć, czy pliki się zmieniły i jakie operacje są wymagane.

source: po4a - Get involved!
pl: po4a - Zaangażuj się!

source: Get involved!
pl: Zaangażuj się!

source: If you want to participate, you can contact us
pl: Aby się przyłączyć do projektu, skontaktuj się z nami

source: on our <a href="mailto:po4a-devel@lists.alioth.debian.org">mailing list</a>,
pl: poprzez naszą <a href="mailto:po4a-devel@lists.alioth.debian.org">listę dyskusyjną</a>,

source: on IRC (#po4a on oftc).
pl: przez IRC (#po4a na oftc).

source: Bug reports, patches, feature requests or any feedback are welcome on the mailing list, in the <a href="http://alioth.debian.org/tracker/?atid=410622&amp;group_id=30267">Alioth tracker</a> or in the <a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?pkg=po4a;dist=unstable">Debian BTS</a>.
pl: Z radością przyjmiemy wszelkie zgłoszenia błędów, łaty, żądania nowych funkcjonalności lub jakikolwiek opinie. Prosimy o ich przysyłanie na naszą listę dyskusyjną lub rejestrowanie ich w <a href="http://alioth.debian.org/tracker/?atid=410622&amp;group_id=30267">systemie Alioth</a> albo w <a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?pkg=po4a;dist=unstable">systemie śledzenia błędów Debiana</a>.

source: Commit emails are sent on a separate <a href="mailto:po4a-commits@lists.alioth.debian.org">mailing list</a>.
pl: E-maile związane z zatwierdzaniem zmian w repozytorium CVS są wysyłane na oddzielną <a href="mailto:po4a-commits@lists.alioth.debian.org">listę dyskusyjną</a>.

source: TODO
pl: DO ZROBIENIA

source: We are looking for people interesting in testing/porting on Windows
pl: Poszukujemy ludzi zainteresowanych testowaniem i przenoszeniem po4a na platformę Windows.

source: Support for XLIFF would be welcome.
pl: Wsparcie dla formatu XLIFF będzie mile widziane.

source: Implementation of a C extension to make po4a faster is ongoing.
pl: Trwa implementowanie rozszerzenia w C, które zwiększy szybkość działania po4a.

source: Welcome
pl: Witamy

source: Features
pl: Cechy

source: Download
pl: Pobieranie

source: Get Involved
pl: Zaangażuj się

source: Translations
pl: Tłumaczenia

source: po4a - Translations
pl: po4a - Tłumaczenia

source: Translating
pl: Tłumaczenie

source: Strings are usually frozen one or two week before the releases. Tell us if you want to be notified.
pl: Komunikaty do przetłumaczenia są zazwyczaj zamrażana na tydzień lub dwa przed wydaniem kolejnej wersji po4a. Prosimy nas powiadomić, jeśli chcesz być informowany o nowych wersjach.

source: See below for the list of available translations and work needed.
pl: Poniżej przedstawiono listę dostępnych tłumaczeń.

source: You can find the translation material on our Subversion repository (<a href="http://anonscm.debian.org/viewvc/po4a/trunk/po/bin/">translation of the program</a>, <a href="http://anonscm.debian.org/viewvc/po4a/trunk/po/pod/">translation of the documentation</a>, <a href="http://anonscm.debian.org/viewvc/po4a/web/po/">translation of the website</a>).
pl: Materiał do przetłumaczenia można znaleźć w naszym repozytorium Subversion (<a href="http://anonscm.debian.org/viewvc/po4a/trunk/po/bin/">tłumaczenia programu</a>, <a href="http://anonscm.debian.org/viewvc/po4a/trunk/po/pod/">tłumaczenia dokumentacji</a>, <a href="http://anonscm.debian.org/viewvc/po4a/web/po/">tłumaczenia strony www</a>).

source: Available translations
pl: Dostępne tłumaczenia

source: Po4a is currently translated in the following languages:
pl: Obecnie po4a zostało przetłumaczone na następujące języki:

source: Translations of the documentation
pl: Tłumaczenia dokumentacji

source: The po4a documentation is also translated in the following languages:
pl: Dokumentacja po4a jest dostępna w następujących językach:

source: Translations of the web site
pl: Tłumaczenia strony sieci web

source: This web site is also translated in the following languages:
pl: Strona sieci web jest przetłumaczona na następujące języki:
